org/system/gentoo/20230311-ccache.org
:PROPERTIES:
:ID:       2bf472e6-2b54-419b-a8a5-3f015d8ba4e4
:END:
#+title: ccache
 -> [[id:050e9166-394b-40bb-8135-a45ab4419153][MAIN メイン]] -> [[id:b0d37831-1dcd-47be-ba0b-3bd8a7df063e][LINUX リナックス]] / [[id:5b8d8a26-f3dd-4e50-b144-9eff85eadf96][BSD]] / [[id:0b378ebf-dc0b-4fca-825d-1ed7cfcebf1b][WINDOWS ウィンドウズ]] -> [[id:9be91f09-e446-4d22-931e-c05792d8f582][SYSAPPS アプリ]]

[[https://wiki.gentoo.org/wiki/Ccache][gentoo wiki]]
[[https://wiki.archlinux.org/title/Ccache][arch wiki]]

* package

arch -> ~ccache~
gentoo -> ~dev-util/ccache~

* install
first, enable ccache support in ~/etc/portage/make.conf~
#+begin_src
FEATURES="ccache"
CCACHE_DIR="/var/cache/ccache"
#+end_src

configure the configuration file to your liking
-> ~/var/cache/ccache/ccache.conf~
example config
#+begin_src
# Maximum cache size to maintain
max_size = 100.0G

# Allow others to run 'ebuild' and share the cache.
umask = 002

# Don't include the current directory when calculating
# hashes for the cache. This allows re-use of the cache
# across different package versions, at the cost of
# slightly incorrect paths in debugging info.
# https://ccache.dev/manual/4.4.html#_performance
hash_dir = false

# Preserve cache across GCC rebuilds and
# introspect GCC changes through GCC wrapper.
#
# We use -dumpversion here instead of -v,
# see https://bugs.gentoo.org/872971.
compiler_check = %compiler% -dumpversion

# I expect 1.5M files. 300 files per directory.
cache_dir_levels = 3

# Logging setup is optional
# Portage runs various phases as different users
# so beware of setting a log_file path here: the file
# should already exist and be writable by at least
# root and portage. If a log_file path is set, don't
# forget to set up log rotation!
# log_file = /var/log/ccache.log
# Alternatively, log to syslog
# log_file = syslog
#+end_src

enable ccache for your current user
in ~.zshrc~ or ~.bashrc~
#+begin_src
export PATH="/usr/lib/ccache/bin:${PATH}"
export CCACHE_DIR="/var/cache/ccache"
#+end_src

* usage
see the cache hit statistics with
~$ CCACHE_DIR=/var/cache/ccache ccache -s~

this command will clear the cache
~$ CCACHE_DIR=/var/cache/ccache ccache -C~
