public/system/gentoo/20230311-ccache.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ccache</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ccache</h1>
<p>
-&gt; <a href="../../index.html#ID-050e9166-394b-40bb-8135-a45ab4419153">MAIN メイン</a> -&gt; <a href="../../study/linux/20230428-linux.html#ID-b0d37831-1dcd-47be-ba0b-3bd8a7df063e">LINUX リナックス</a> / <a href="../../other/main/20230428-bsd.html#ID-5b8d8a26-f3dd-4e50-b144-9eff85eadf96">BSD</a> / <a href="../windows/20230428-windows.html#ID-0b378ebf-dc0b-4fca-825d-1ed7cfcebf1b">WINDOWS ウィンドウズ</a> -&gt; <a href="../../other/main/20230428-sysapps.html#ID-9be91f09-e446-4d22-931e-c05792d8f582">SYSAPPS アプリ</a>
</p>

<p>
<a href="https://wiki.gentoo.org/wiki/Ccache">gentoo wiki</a>
<a href="https://wiki.archlinux.org/title/Ccache">arch wiki</a>
</p>

<div id="outline-container-org0ba4b1a" class="outline-2">
<h2 id="org0ba4b1a">package</h2>
<div class="outline-text-2" id="text-org0ba4b1a">
<p>
arch -&gt; <code>ccache</code>
gentoo -&gt; <code>dev-util/ccache</code>
</p>
</div>
</div>

<div id="outline-container-orgbf29601" class="outline-2">
<h2 id="orgbf29601">install</h2>
<div class="outline-text-2" id="text-orgbf29601">
<p>
first, enable ccache support in <code>/etc/portage/make.conf</code>
</p>
<pre class="example">
FEATURES="ccache"
CCACHE_DIR="/var/cache/ccache"
</pre>

<p>
configure the configuration file to your liking
-&gt; <code>/var/cache/ccache/ccache.conf</code>
example config
</p>
<pre class="example">
# Maximum cache size to maintain
max_size = 100.0G

# Allow others to run 'ebuild' and share the cache.
umask = 002

# Don't include the current directory when calculating
# hashes for the cache. This allows re-use of the cache
# across different package versions, at the cost of
# slightly incorrect paths in debugging info.
# https://ccache.dev/manual/4.4.html#_performance
hash_dir = false

# Preserve cache across GCC rebuilds and
# introspect GCC changes through GCC wrapper.
#
# We use -dumpversion here instead of -v,
# see https://bugs.gentoo.org/872971.
compiler_check = %compiler% -dumpversion

# I expect 1.5M files. 300 files per directory.
cache_dir_levels = 3

# Logging setup is optional
# Portage runs various phases as different users
# so beware of setting a log_file path here: the file
# should already exist and be writable by at least
# root and portage. If a log_file path is set, don't
# forget to set up log rotation!
# log_file = /var/log/ccache.log
# Alternatively, log to syslog
# log_file = syslog
</pre>

<p>
enable ccache for your current user
in <code>.zshrc</code> or <code>.bashrc</code>
</p>
<pre class="example">
export PATH="/usr/lib/ccache/bin:${PATH}"
export CCACHE_DIR="/var/cache/ccache"
</pre>
</div>
</div>

<div id="outline-container-org50302ba" class="outline-2">
<h2 id="org50302ba">usage</h2>
<div class="outline-text-2" id="text-org50302ba">
<p>
see the cache hit statistics with
<code>$ CCACHE_DIR=/var/cache/ccache ccache -s</code>
</p>

<p>
this command will clear the cache
<code>$ CCACHE_DIR=/var/cache/ccache ccache -C</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>